vehicle-exp-api/src/test/resources/scaffolder/request/vehicle-exp-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.cloudhub.io/schemas/class/InchcapeVehicleInterface_v1">

   <soapenv:Body>
      <inc:sendVehicle>
         <inc:Vehicle>
            	<inc:BusinessId>Trivett Australia</inc:BusinessId>
            	<inc:ExternalId>palash_2021</inc:ExternalId>
            	<inc:ExternalVehicleId>Palash2021</inc:ExternalVehicleId>
            	<inc:SourceSystem>VMS</inc:SourceSystem>
			<inc:StockNumber>1233vf</inc:StockNumber>
			<inc:VIN>J123XXX</inc:VIN>
			<inc:Make>Subaru</inc:Make>
			<inc:ModelCode>BN9AK7C</inc:ModelCode>
			<inc:ModelYear>2015</inc:ModelYear>
			<inc:EngineNumber>123</inc:EngineNumber>
			<inc:KeyNumber>123</inc:KeyNumber>
			<inc:ExternalColour>Black</inc:ExternalColour>
			<inc:InternalColour>Black</inc:InternalColour>
			<inc:BuildDate>2016-01-12</inc:BuildDate>
			<inc:ReceivedInStockDate>2017-01-01</inc:ReceivedInStockDate>
			<inc:DeliveryDate>2017-01-11</inc:DeliveryDate>
               <inc:PrimaryStatus>Retailed</inc:PrimaryStatus>
			<inc:OdometerReading>234</inc:OdometerReading>
			<inc:ExternalSalespersonId>123</inc:ExternalSalespersonId>
			<inc:ModelColourCode>123</inc:ModelColourCode>
         </inc:Vehicle>
         <!--Zero or more repetitions:-->
         <inc:vehicleAssociations>         
            	<inc:BusinessId>Trivett Australia</inc:BusinessId>
            	<inc:ExternalId>palash_2021</inc:ExternalId>
			<inc:ExternalVehicleId>Palash2021</inc:ExternalVehicleId>
            	<inc:VIN>J123XXX</inc:VIN>
           	<inc:SourceSystem>VMS</inc:SourceSystem>
            	<inc:ExternalEntityId>45678</inc:ExternalEntityId>
            	<inc:ExternalEntityType>Individual</inc:ExternalEntityType>
            	<inc:AssociationType>Owner</inc:AssociationType>
            	<inc:ExternalFleetId>FL0011100</inc:ExternalFleetId>
			<inc:ExternalSellingDealerId>111</inc:ExternalSellingDealerId>
			<inc:IsPrimary>true</inc:IsPrimary>
			<inc:IsReversal>false</inc:IsReversal>
			<inc:RegistrationNumber>ABC123</inc:RegistrationNumber>
             	<inc:StartDate>2017-08-01</inc:StartDate>
			<inc:EndDate>2017-09-02</inc:EndDate>
         </inc:vehicleAssociations>
		 	 
         <!--Zero or more repetitions:-->
         <inc:vehiclePolicies>
           	 <inc:BusinessId>Trivett Australia</inc:BusinessId>
            	<inc:ExternalId>palash_2021</inc:ExternalId>
            	<inc:ExternalVehicleId>Palash2021</inc:ExternalVehicleId>
			<inc:ExternalCustomerId>ads5231</inc:ExternalCustomerId>
           	 <inc:SourceSystem>VMS</inc:SourceSystem>
            	<inc:VIN>JXVC123456DC12345</inc:VIN>
			<inc:Provider>Allianz</inc:Provider>
			<inc:PolicyStatus>Active</inc:PolicyStatus>
			<inc:Type>Extended Warranty</inc:Type>
           	 <inc:StartDate>2020-02-10</inc:StartDate>
           	 <inc:EndDate>2023-02-10</inc:EndDate>
			<inc:InceptionDate>2017-02-10</inc:InceptionDate>
			<inc:LinkToOwner>false</inc:LinkToOwner>
			<inc:ProviderPolicyNumber>87RX123214</inc:ProviderPolicyNumber>
			<inc:ProviderStatus>Active</inc:ProviderStatus>
			<inc:ProviderMarketing>true</inc:ProviderMarketing>
			<inc:InvalidReason>Age Invalid</inc:InvalidReason>
			<inc:PendingAction>Activate</inc:PendingAction>
			<inc:ProvisioningStatus>Pending</inc:ProvisioningStatus>
			<inc:ProvisioningError>Test</inc:ProvisioningError>
         </inc:vehiclePolicies>
      </inc:sendVehicle>
   </soapenv:Body>
</soapenv:Envelope>